{
    "architectures": [
        "LlamaForCausalLM"
    ],
    "auto_map": {
        "AutoModelForCausalLM": "togethercomputer/LLaMA-2-7B-32K--modeling_flash_llama.LlamaForCausalLM"
    },
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 32768,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
        "factor": 8.0,
        "type": "linear"
    },
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.31.0",
    "use_cache": true,
    "vocab_size": 32000,
    "quantization_config": {
        "bits": 4,
        "group_size": 128,
        "damp_percent": 0.1,
        "desc_act": false,
        "sym": true,
        "true_sequential": true,
        "model_name_or_path": null,
        "model_file_base_name": "model",
        "quant_method": "gptq"
    }
}